Repository: mraron/cms
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: de

source: N/A
de: nicht verfügbar

source: Not correct
de: Nicht korrekt

source: Correct
de: Korrekt

source: Partially correct
de: Teilweise korrekt

source: Case
de: Test- fall

source: Outcome
de: Ergebnis

source: Execution time
de: Laufzeit

source: Memory used
de: Verwendeter Speicher

source: Group
de: Gruppe

source: Score Verdicts
de: Punktzahlurteile

source: Group and Testcase Verdicts
de: Gruppen- und Testfallurteile

source: Sample score
de: Beispielpunktzahl

source: Final score
de: Endgültige Punktzahl

source: T
de: Z

source: M
de: S

source: Testcase verdict
de: Testfallurteil

source: Group verdict
de: Gruppenurteil

source: Score details temporarily unavailable.
de: Punktzahldetails derzeit nicht verfügbar.

source: Subtask %(index)s
de: Teilaufgabe %(index)s

source: Compilation succeeded
de: Kompilation erfolgreich

source: Your submission successfully compiled to an executable.
de: Deine Einsendung wurde erfolgreich zu einer ausführbaren Datei kompiliert.

source: Compilation failed
de: Kompilation fehlgeschlagen

source: Your submission did not compile correctly.
de: Deine Einsendung konnte nicht fehlerfrei kompiliert werden.

source: Compilation timed out
de: Kompilationszeitlimit überschritten

source: Your submission exceeded the time limit while compiling. This might be caused by an excessive use of C++ templates, for example.
de: Beim Kompilieren Deiner Einsendung wurde das Zeitlimit überschritten. Das könnte zum Beispiel an einer übermäßigen Nutzung von C++-Templates liegen.

source: Compilation killed with signal %s (could be triggered by violating memory limits)
de: Kompilation beendet mit Signal %s (möglicherweise ausgelöst durch das Verletzen von Speicherlimits)

source: Your submission was killed with the specified signal. Among other things, this might be caused by exceeding the memory limit for the compilation, and in turn by an excessive use of C++ templates, for example.
de: Deine Einsendung wurde mit dem angegebenen Signal beendet. Unter anderem könnte dies an einer Überschreitung des Speicherlimits, und diese wiederum an einer übermäßigen Nutzung von C++-Templates, liegen.

source: Output is correct
de: Die Ausgabe ist korrekt

source: Your submission ran and gave the correct answer
de: Deine Einsendung lief und produzierte die richtige Ausgabe.

source: Output is partially correct
de: Die Ausgabe ist teilweise korrekt

source: Your submission ran and gave the partially correct answer
de: Deine Einsendung lief und produzierte eine teilweise richtige Ausgabe.

source: Output isn't correct
de: Die Ausgabe ist nicht korrekt

source: Your submission ran, but gave the wrong answer
de: Deine Einsendung lief, produzierte aber die falsche Ausgabe.

source: Evaluation didn't produce file %s
de: Bei Ausführung wurde keine Datei %s erzeugt

source: Your submission ran, but did not write on the correct output file
de: Deine Einsendung lief, schrieb aber nichts in die richtige Ausgabedatei.

source: Execution timed out
de: Zeitlimit überschritten

source: Your submission used too much CPU time.
de: Deine Einsendung benötigte zu viel CPU-Zeit.

source: Execution timed out (wall clock limit exceeded)
de: Zeitlimit überschritten (Echtzeitlimit überschritten)

source: Your submission used too much total time. This might be triggered by undefined code, or buffer overflow, for example. Note that in this case the CPU time visible in the submission details might be much smaller than the time limit.
de: Deine Einsendung benötigte insgesamt zu viel Zeit. Dies könnte zum Beispiel von undefiniertem Code oder einem Buffer Overflow ausgelöst worden sein. Beachte, dass in diesem Fall die in den Einsendungsdetails angezeigte CPU-Zeit viel kleiner sein kann als das Zeitlimit.

source: Execution killed (could be triggered by violating memory limits)
de: Ausführung beendet (möglicherweise ausgelöst durch das Verletzen von Speicherlimits)

source: The evaluation was killed by a signal. Among other things, this might be caused by exceeding the memory limit. Note that if this is the reason, the memory usage visible in the submission details is the usage before the allocation that caused the signal.
de: Die Auswertung wurde mit einem Signal beendet. Unter anderem könnte dies an einer Überschreitung des Speicherlimits liegen. Beachte, dass in diesem Fall der in den Einsendungsdetails angezeigte Speicherbedarf der Bedarf vor der Zuweisung ist, die das Signal ausgelöst hat.

source: Execution failed because the return code was nonzero
de: Ausführung fehlgeschlagen, da der Rückgabewert (return-Code) nicht Null war

source: Your submission failed because it exited with a return code different from 0.
de: Deine Einsendung ist fehlgeschlagen, da sie mit einem von Null verschiedenen Rückgabewert (return-Code) endete.

source: Execution completed successfully
de: Ausführung erfolgreich beendet

source: No compilation needed
de: Keine Kompilation nötig

source: File not submitted
de: Datei nicht eingesendet

source: Question too long!
de: Frage zu lang!

source: Subject must be at most %(max_subject_length)d characters, content at most %(max_text_length)d.
de: Der Betreff darf höchstens %(max_subject_length)d Zeichen, der Inhalt höchstens %(max_text_length)d Zeichen lang sein.

source: contest-token
de: Wettbewerbs-Token

source: contest-tokens
de: Wettbewerbs-Tokens

source: task-token
de: Aufgaben-Token

source: task-tokens
de: Aufgaben-Tokens

source: You don't have %(type_pl)s available for this task.
de: Du hast keine %(type_pl)s für diese Aufgabe.

source: You have an infinite number of %(type_pl)s for this task.
de: Du hast unendlich viele %(type_pl)s für diese Aufgabe.

source: You start with no %(type_pl)s.
de: Du hast am Anfang keine %(type_pl)s.

source: You start with one %(type_s)s.
de: Du hast am Anfang einen %(type_s)s.

source: Every minute
de: Jede Minute

source: you get another %(type_s)s,
de: bekommst Du einen weiteren %(type_s)s,

source: up to a maximum of one %(type_s)s.
de: bis zu einem Maximum von einem %(type_s)s.

source: you get another %(type_s)s.
de: bekommst Du einen weiteren %(type_s)s.

source: You don't get other %(type_pl)s.
de: Du bekommst keine weiteren %(type_pl)s.

source: You can use a %(type_s)s every second
de: Du kannst einen %(type_s)s pro Sekunde benutzen

source: and no more than one %(type_s)s in total.
de: und insgesamt nicht mehr als einen %(type_s)s.

source: You can use a %(type_s)s every second.
de: Du kannst einen %(type_s)s pro Sekunde benutzen.

source: You can use no more than one %(type_s)s in total.
de: Du kannst insgesamt nicht mehr als einen %(type_s)s benutzen.

source: Too many print jobs!
de: Zu viele Druckaufträge!

source: You have reached the maximum limit of at most %d print jobs.
de: Du hast das Limit von höchstens %d Druckaufträgen erreicht.

source: Invalid format!
de: Ungültiges Format!

source: Please select the correct files.
de: Bitte wähle die richtigen Dateien aus.

source: File too big!
de: Datei zu groß!

source: Each file must be at most %d bytes long.
de: Jede Datei darf höchstens %d Bytes groß sein.

source: Print job storage failed!
de: Speichern des Druckauftrags fehlgeschlagen!

source: Please try again.
de: Bitte erneut versuchen.

source: Token request discarded
de: Token-Abfrage verworfen

source: Your request has been discarded because you have no tokens available.
de: Deine Abfrage wurde verworfen, da Du keine Tokens zur Verfügung hast.

source: Your request has been discarded because you already used a token on that submission.
de: Deine Abfrage wurde verworfen, da Du auf diese Einsendung bereits ein Token angewendet hast.

source: Question received
de: Frage erhalten

source: Your question has been received, you will be notified when it is answered.
de: Deine Frage wurde erhalten; Du wirst benachrichtigt, wenn sie beantwortet wurde.

source: Print job received
de: Druckauftrag erhalten

source: Your print job has been received.
de: Dein Druckauftrag wurde erhalten.

source: Submission received
de: Einsendung erhalten

source: Your submission has been received and is currently being evaluated.
de: Deine Einsendung wurde erhalten und wird derzeit ausgewertet.

source: Compiling...
de: Kompilieren...

source: Evaluating...
de: Auswerten...

source: Scoring...
de: Bewerten...

source: Evaluated
de: Ausgewertet

source: Token request received
de: Token-Abfrage erhalten

source: Your request has been received and applied to the submission.
de: Deine Abfrage wurde erhalten und auf die Einsendung angewendet.

source: Test received
de: Test erhalten

source: Your test has been received and is currently being executed.
de: Dein Test wurde erhalten und wird derzeit ausgeführt.

source: Executing...
de: Ausführen...

source: Executed
de: Ausgeführt

source: Too many submissions!
de: Zu viele Einsendungen!

source: You have reached the maximum limit of at most %d submissions among all tasks.
de: Du hast das Limit von höchstens %d Einsendungen, verteilt über alle Aufgaben, erreicht.

source: You have reached the maximum limit of at most %d submissions on this task.
de: Du hast das Limit von höchstens %d Einsendungen zu dieser Aufgabe erreicht.

source: Submissions too frequent!
de: Zu häufige Einsendungen!

source: Among all tasks, you can submit again after %d seconds from last submission.
de: Verteilt über alle Aufgaben darfst Du %d Sekunden nach einer Einsendung wieder einsenden.

source: For this task, you can submit again after %d seconds from last submission.
de: Zu dieser Aufgabe darfst Du %d Sekunden nach einer Einsendung wieder einsenden.

source: Invalid archive format!
de: Ungültiges Archivformat!

source: The submitted archive could not be opened.
de: Das eingesendete Archiv konnte nicht geöffnet werden.

source: Invalid submission format!
de: Ungültiges Einsendungsformat!

source: Submission too big!
de: Einsendung zu groß!

source: Each source file must be at most %d bytes long.
de: Jede Quelldatei darf höchstens %d Bytes groß sein.

source: Submission storage failed!
de: Speichern der Einsendung fehlgeschlagen!

source: Too many tests!
de: Zu viele Tests!

source: You have reached the maximum limit of at most %d tests among all tasks.
de: Du hast das Limit von höchstens %d Tests, verteilt über alle Aufgaben, erreicht.

source: You have reached the maximum limit of at most %d tests on this task.
de: Du hast das Limit von höchstens %d Tests zu dieser Aufgabe erreicht.

source: Tests too frequent!
de: Tests zu häufig!

source: Among all tasks, you can test again after %d seconds from last test.
de: Verteilt über alle Aufgaben darfst Du %d Sekunden nach einem Test wieder einsenden.

source: For this task, you can test again after %d seconds from last test.
de: Zu dieser Aufgabe darfst Du %d Sekunden nach einem Test wieder testen.

source: Invalid test format!
de: Ungültiges Testformat!

source: Test too big!
de: Test zu groß!

source: Input too big!
de: Eingabe zu groß!

source: The input file must be at most %d bytes long.
de: Die Eingabedatei darf höchstens %d Bytes groß sein.

source: Test storage failed!
de: Speichern des Tests fehlgeschlagen!

source: Communication
de: Konversation

source: Announcements
de: Ankündigungen

source: (no subject)
de: (kein Betreff)

source: Questions
de: Fragen

source: Subject
de: Betreff

source: Ask question
de: Frage stellen

source: Reset
de: Zurücksetzen

source: no answer yet
de: noch keine Antwort

source: Messages
de: Nachrichten

source: Automatic (%(lang)s)
de: Auto (%(lang)s)

source: Logout
de: Abmelden

source: Logged in as <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
de: Angemeldet als <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>

source: Failed to log in.
de: Anmeldung fehlgeschlagen.

source: Welcome
de: Willkommen

source: Please log in
de: Bitte anmelden

source: Username
de: Benutzername

source: Password
de: Passwort

source: Login
de: Anmelden

source: Don't have an account?
de: Du hast noch keinen Zugang?

source: Register
de: Registrieren

source: New message
de: Neue Nachricht

source: New announcement
de: Neue Ankündigung

source: New answer
de: Neue Antwort

source: %d unread
de: %d ungelesen

source: Until contest starts:
de: Bis zum Beginn des Wettbewerbs:

source: Until contest ends:
de: Bis zum Ende des Wettbewerbs:

source: Until analysis starts:
de: Bis zum Beginn des Analyse-Modus:

source: Until analysis ends:
de: Bis zum Ende des Analyse-Modus:

source: Time left:
de: Verbleibende Zeit:

source: Server time:
de: Server-Zeit:

source: Overview
de: Übersicht

source: Statement
de: Angabe

source: Submissions
de: Einsendungen

source: Documentation
de: Dokumentation

source: Testing
de: Testen

source: Printing
de: Drucken

source: is released under the
de: steht unter der

source: Choose a contest
de: Wähle einen Wettbewerb aus

source: Programming languages and libraries
de: Programmiersprachen und Bibliotheken

source: The main Java class of the solution should have exactly the same name as the task.
de: Der Name der Java-Hauptklasse muss dem der Aufgabe genau entsprechen.

source: Submission details for compilation
de: Einsendungsdetails die Kompilation betreffend

source: Message
de: Meldung

source: Explanation
de: Erklärung

source: Submission details for evaluation
de: Einsendungsdetails die Auswertung betreffend

source: Error %(status_code)s
de: Fehler %(status_code)s

source: An error occured while the server was handling your request.
de: Bei der Bearbeitung Deiner Anfrage durch den Server ist ein Fehler aufgetreten.

source: Note that attempts to tamper with Contest Management System (such as probing the server with customized URLs) may be considered cheating and may lead to disqualification.
de: Wir weisen darauf hin, dass Versuche, sich am Contest Management System zu schaffen zu machen (wie das Sondieren angepasster URLs), als Unterschleif ausgelegt werden können und möglicherweise die Disqualifizierung nach sich ziehen.

source: If you encountered this error during normal usage, please notify the contest administrators.
de: Falls dieser Fehler bei normaler Benutzung aufgetreten ist, verständige bitte die Wettbewerbs-Administratoren.

source: General information
de: Allgemeines

source: The contest hasn't started yet.
de: Der Wettbewerb hat noch nicht begonnen.

source: The contest will start at %(start_time)s and will end at %(stop_time)s.
de: Der Wettbewerb beginnt am %(start_time)s und endet am %(stop_time)s.

source: The contest is currently running.
de: Der Wettbewerb läuft gerade.

source: The contest started at %(start_time)s and will end at %(stop_time)s.
de: Der Wettbewerb hat am %(start_time)s begonnen und wird am %(stop_time)s enden.

source: The contest has already ended.
de: Der Wettbewerb hat bereits geendet.

source: The contest started at %(start_time)s and ended at %(stop_time)s.
de: Der Wettbewerb hat am %(start_time)s begonnen und am %(stop_time)s geendet.

source: The analysis mode hasn't started yet.
de: Der Analysis-Modus hat noch nicht begonnen.

source: The analysis mode will start at %(start_time)s and will end at %(stop_time)s.
de: Der Analysis-Modus beginnt am %(start_time)s und endet am %(stop_time)s.

source: The analysis mode is currently running.
de: Der Analysis-Modus läuft gerade.

source: The analysis mode started at %(start_time)s and will end at %(stop_time)s.
de: Der Analysis-Modus hat am %(start_time)s begonnen und wird am %(stop_time)s enden.

source: The analysis mode has already ended.
de: Der Analysis-Modus hat bereits geendet.

source: The analysis mode started at %(start_time)s and ended at %(stop_time)s.
de: Der Analysis-Modus hat am %(start_time)s begonnen und am %(stop_time)s geendet.

source: You have an infinite number of tokens.
de: Du hast unendlich viele Tokens.

source: You can see the detailed result of a submission by using a token on it.
de: Du kannst die ausführlichen Ergebnisse einer Einsendung sehen, indem Du ein Token darauf anwendest.

source: Your score for each task will be the maximum among the tokened submissions and the last one.
de: Deine Punktzahl für jede Aufgabe ist das Maximum unter den mit Token versehenen Einsendungen und der letzten Einsendung.

source: You have a distinct set of tokens for each task.
de: Für jede Aufgabe hast Du eine eigene Menge an Tokens.

source: You can find the rules for the %(type_pl)s on each task's description page.
de: Die Regeln für die %(type_pl)s findest Du auf den Seiten mit den Aufgabenbeschreibungen.

source: You have a set of tokens shared among all tasks.
de: Für alle Aufgaben zusammen steht Dir eine Menge an Tokens zur Verfügung.

source: You have two types of tokens: a set of <em>contest-tokens</em> shared among all tasks and a distinct set of <em>task-tokens</em> for each task.
de: Du hast zwei Arten von Tokens: Für alle Aufgaben zusammen eine Menge an <em>Wettbewerbs-Tokens</em>, für jede Aufgabe eine eigene Menge an <em>Aufgaben-Tokens</em>.

source: You can see the detailed result of a submission by using two tokens on it, one of each type.
de: Du kannst die ausführlichen Ergebnisse einer Einsendung sehen, indem Du zwei Tokens darauf anwendest, eines von jeder Sorte.

source: You can submit at most %(submissions)s solutions during this contest.
de: Du kannst in diesem Wettbewerb höchstens %(submissions)s Lösungen einsenden.

source: You can submit at most %(user_tests)s user tests during this contest.
de: Du kannst in diesem Wettbewerb höchstens %(user_tests)s Tests einsenden.

source: Every user is allowed to compete (i.e. submit solutions) for a uninterrupted time frame of %(per_user_time)s.
de: Jeder Teilnehmer darf in einem kontinuierlichen Zeitfenster von %(per_user_time)s teilnehmen (d.h. Lösungen einsenden).

source: As soon as the contest starts you can choose to start your time frame.
de: Sobald der Wettbewerb beginnt, kannst Du Dich entscheiden, Dein Zeitfenster zu öffnen.

source: Once you start, you can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
de: Sobald Du beginnst, kannst Du bis zum Ende des Zeitfensters oder bis zum Ende des Wettbewerbs Lösungen einschicken, was immer zuerst kommt.

source: By clicking on the button below you can start your time frame.
de: Indem Du auf den untenstehenden Knopf drückst, kannst Du Dein Zeitfenster öffnen.

source: You started your time frame at %(start_time)s.
de: Du hast Dein Zeitfenster um %(start_time)s geöffnet.

source: You can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
de: Du kannst bis zum Ende des Zeitfensters oder bis zum Ende des Wettbewerbs Lösungen einschicken, was immer zuerst kommt.

source: You started your time frame at %(start_time)s and you already finished it.
de: Du hast Dein Zeitfenster um %(start_time)s geöffnet und es hat bereits geendet.

source: There's nothing you can do now.
de: Gerade kannst Du nichts tun.

source: You never started your time frame. Now it's too late.
de: Du hast Dein Zeitfenster nie geöffnet -- jetzt ist's zu spät.

source: Start!
de: Los!

source: Task overview
de: Aufgabenübersicht

source: Task
de: Aufgabe

source: Time limit
de: Zeitlimit

source: Memory limit
de: Speicherlimit

source: Type
de: Art

source: Files
de: Dateien

source: Yes
de: Ja

source: No
de: Nein

source: Print
de: Drucken

source: You can print %(remaining_jobs)s more text or PDF files of up to %(max_pages)s pages each.
de: Du kannst noch %(remaining_jobs)s Text- oder PDF-Dateien mit je bis zu %(max_pages)s Seiten drucken.

source: You can print %(remaining_jobs)s more text files of up to %(max_pages)s pages each.
de: Du kannst noch %(remaining_jobs)s Text-Dateien mit je bis zu %(max_pages)s Seiten drucken.

source: File (text or PDF)
de: Datei (Text oder PDF)

source: File (text)
de: Datei (Text)

source: Submit
de: Abschicken

source: You cannot print anything any more as you have used up your printing quota.
de: Du kannst nichts mehr ausdrucken, da Du Dein Druckkontingent aufgebraucht hast.

source: Previous print jobs
de: Bisherige Druckaufträge

source: Date and time
de: Tag und Zeit

source: Time
de: Zeit

source: File name
de: Dateiname

source: Preparing...
de: Aufbereiten...

source: no print jobs yet
de: noch keine Druckaufträge

source: The passwords do not match!
de: Die Passwörter stimmen nicht überein!

source: This username is already taken, please choose a different one.
de: Dieser Benutzername ist schon vergeben, bitte wähle einen anderen.

source: New user
de: Neuer Benutzer

source: Please fill in the fields to register
de: Fülle bitte die Felder aus, um Dich zu registrieren

source: First name
de: Vorname

source: Last name
de: Nachname

source: Must be one character or more.
de: Muss mindestens ein Zeichen enthalten.

source: Confirm password
de: Passwort bestätigen

source: The user was created successfully!
de: Der Benutzer wurde erfolgreich erstellt!

source: Your username is:
de: Dein Benutzername ist:

source: The password you chose was stored securely.
de: Das gewählte Passwort wurde sicher gespeichert.

source: Back to login
de: Zurück zur Anmeldung

source: Compilation output
de: Kompilationsausgabe

source: Compilation outcome:
de: Kompilationsergebnis:

source: Compilation time:
de: Kompilationszeit:

source: Memory used:
de: Speicherbedarf:

source: %(name)s (%(short_name)s) <small>description</small>
de: %(name)s (%(short_name)s) <small>Beschreibung</small>

source: no statement available
de: keine Angabe verfügbar

source: Download task statement
de: Angabe zur Aufgabe herunterladen

source: The statement for this task is available in multiple versions, in different languages.
de: Die Angabe zu dieser Aufgabe steht in mehreren Fassungen in mehreren Sprachen zur Verfügung.

source: You can see (and download) all of them using the list on the right.
de: Du siehst sie in der Liste auf der rechten Seite (und kannst sie dort herunterladen).

source: Some suggested translations follow.
de: Hier sind einige vorgeschlagene Übersetzungen:

source: Statement in <b>%(lang)s</b>
de: Angabe auf <b>%(lang)s</b>

source: Statement in %(lang)s
de: Angabe auf %(lang)s

source: Some details
de: Einzelheiten

source: Compilation commands
de: Kompilierbefehle

source: You can find the rules for the %(type_pl)s on the <a href="%(contest_root)s">contest overview page</a>.
de: Die Regeln für die %(type_pl)s findest Du in der <a href="%(contest_root)s">Übersicht</a>.

source: Remember that to see the detailed result of a submission you need to use both a contest-token and a task-token.
de: Bedenke, dass Du sowohl ein Wettbewerbs-Token als auch ein Aufgaben-Token einsetzen musst, um das ausführliche Ergebnis einer Einsendung zu sehen.

source: Attachments
de: Anhänge

source: unknown
de: unbekannt

source: loading...
de: laden...

source: %(name)s (%(short_name)s) <small>submissions</small>
de: %(name)s (%(short_name)s) <small>Einsendungen</small>

source: Submit a solution
de: Lösung einsenden

source: You can submit %(submissions_left)s more solution(s).
de: Du kannst noch %(submissions_left)s Lösung(en) einsenden.

source: submission.zip
de: Einsendung.zip

source: Previous submissions
de: Bisherige Einsendungen

source: Right now, you have infinite tokens available on this task.
de: Im Augenblick hast Du unendlich viele Tokens für diese Aufgabe zur Verfügung.

source: Right now, you have one token available on this task.
de: Im Augenblick hast Du ein Token für diese Aufgabe zur Verfügung.

source: Right now, you have %(tokens)s tokens available on this task.
de: Im Augenblick hast Du %(tokens)s viele Tokens für diese Aufgabe zur Verfügung.

source: But you have to wait until %(expiration_time)s to use them.
de: Du musst allerdings bis %(expiration_time)s warten, um sie zu benutzen.
