Repository: mraron/cms
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: de

source: You will receive a new token at %(gen_time)s.
de: Du bekommst um %(gen_time)s ein neues Token.

source: In the current situation, no more tokens will be generated.
de: In der derzeitigen Situation werden keine Tokens mehr erzeugt.

source: Right now, you do not have tokens available for this task.
de: Im Augenblick hast Du keine Tokens für diese Aufgabe zur Verfügung.

source: But you will have to wait until %(expiration_time)s to use it.
de: Du musst allerdings bis %(expiration_time)s warten, um es zu benutzen.

source: Unofficial submissions
de: Inoffizielle Einsendungen

source: Official submissions
de: Offizielle Einsendungen

source: Submission details
de: Einsendungsdetails

source: Close
de: Schließen

source: Download
de: Herunterladen

source: Submit a test
de: Test einsenden

source: You can submit %(user_tests_left)s more test(s).
de: Du kannst noch %(user_tests_left)s Test(s) einsenden.

source: input
de: Eingabe

source: Previous tests
de: Bisherige Tests

source: Input
de: Eingabe

source: Output
de: Ausgabe

source: no tests yet
de: noch keine Tests

source: Evaluation outcome
de: Auswertungsergebnis

source: Wait...
de: Augenblick...

source: Actual score
de: Gültige Punktzahl

source: Verdict
de: Urteil

source: no submissions
de: keine Einsendungen

source: No tokens
de: Keine Tokens

source: Invalid file
de: Ungültige Datei

source: Print job has too many pages
de: Druckauftrag hat zu viele Seiten

source: Sent to printer
de: An Drucker gesendet
